{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2025-12-14T23:21:46.715963Z",
     "start_time": "2025-12-14T23:21:46.697538Z"
    }
   },
   "source": [
    "from traceback import print_tb\n",
    "from typing import TextIO\n",
    "import csv\n",
    "import pprint\n",
    "from secret import NEO4J_PASSWORD\n",
    "\n",
    "from neo4j import GraphDatabase, Driver\n",
    "\n",
    "URI = \"neo4j://localhost\"\n",
    "AUTH = (\"neo4j\", NEO4J_PASSWORD)\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n"
   ],
   "outputs": [],
   "execution_count": 234
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T23:21:46.728082Z",
     "start_time": "2025-12-14T23:21:46.721104Z"
    }
   },
   "cell_type": "code",
   "source": [
    "with open(r\"../data/ml-100k/u.item\") as file:\n",
    "    for i, item in enumerate(csv.reader(file, delimiter=\"|\")):\n",
    "        pprint.pprint(item, compact=True)\n",
    "        if i >= 10:\n",
    "            break"
   ],
   "id": "d5e2ccc7908a8516",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['1', 'Toy Story (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Toy%20Story%20(1995)', '0', '0', '0', '1',\n",
      " '1', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0']\n",
      "['2', 'GoldenEye (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?GoldenEye%20(1995)', '0', '1', '1', '0', '0',\n",
      " '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0']\n",
      "['3', 'Four Rooms (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Four%20Rooms%20(1995)', '0', '0', '0', '0',\n",
      " '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0']\n",
      "['4', 'Get Shorty (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Get%20Shorty%20(1995)', '0', '1', '0', '0',\n",
      " '0', '1', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0']\n",
      "['5', 'Copycat (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Copycat%20(1995)', '0', '0', '0', '0', '0',\n",
      " '0', '1', '0', '1', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0']\n",
      "['6', 'Shanghai Triad (Yao a yao yao dao waipo qiao) (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/Title?Yao+a+yao+yao+dao+waipo+qiao+(1995)', '0', '0', '0',\n",
      " '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0',\n",
      " '0']\n",
      "['7', 'Twelve Monkeys (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Twelve%20Monkeys%20(1995)', '0', '0', '0',\n",
      " '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '1', '0', '0',\n",
      " '0']\n",
      "['8', 'Babe (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Babe%20(1995)', '0', '0', '0', '0', '1', '1',\n",
      " '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0']\n",
      "['9', 'Dead Man Walking (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Dead%20Man%20Walking%20(1995)', '0', '0',\n",
      " '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0',\n",
      " '0']\n",
      "['10', 'Richard III (1995)', '22-Jan-1996', '',\n",
      " 'http://us.imdb.com/M/title-exact?Richard%20III%20(1995)', '0', '0', '0', '0',\n",
      " '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0']\n",
      "['11', 'Seven (Se7en) (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Se7en%20(1995)', '0', '0', '0', '0', '0',\n",
      " '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0']\n"
     ]
    }
   ],
   "execution_count": 235
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T23:21:46.757925Z",
     "start_time": "2025-12-14T23:21:46.749029Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def open_file(csv_file_path: str) -> TextIO:\n",
    "    with open(csv_file_path, encoding=\"utf-8\") as f:\n",
    "        return f\n",
    "\n",
    "def read_user(csv_file_path):\n",
    "    user_out = []\n",
    "    with open(csv_file_path, encoding=\"utf-8\") as f:\n",
    "        reader = csv.DictReader(f,fieldnames=[\"userId\", \"age\", \"gender\", \"occupation\", \"zipCode\"] ,delimiter=\"|\")\n",
    "        for i, row in enumerate(reader):\n",
    "            row[\"userId\"] = int(row[\"userId\"])\n",
    "            user_out.append(row)\n",
    "    return user_out\n",
    "\n",
    "def populate_user_txn(tx, user_rows):\n",
    "    query = \"\"\"\n",
    "    UNWIND $users as user\n",
    "    MERGE (u:User {\n",
    "        userId: user.userId\n",
    "    })\n",
    "    SET u.age = user.age,\n",
    "        u.gender = user.gender,\n",
    "        u.zipCode = user.zipCode\n",
    "\n",
    "    MERGE (o:Occupation { occupation: user.occupation })\n",
    "\n",
    "    MERGE (u)-[:HAS_OCCUPATION]->(o)\n",
    "    \"\"\"\n",
    "    try:\n",
    "        tx.run(query, users=user_rows)\n",
    "    except Exception as e:\n",
    "        raise e\n",
    "\n",
    "def create_users(driver: Driver):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        session.execute_write(\n",
    "            populate_user_txn,\n",
    "            read_user(r\"../data/ml-100k/u.user\"),\n",
    "        )\n",
    "    return\n",
    "\n",
    "def read_items(csv_file_path):\n",
    "    out = []\n",
    "    with open(csv_file_path, encoding=\"iso-8859-1\") as f:\n",
    "\n",
    "        reader = csv.DictReader(f, fieldnames= [\n",
    "            \"movieId\", \"title\", \"releaseDate\", \"videoReleaseDate\", \"IMDbURL\",\n",
    "            \"unknown\", \"action\", \"adventure\", \"animation\", \"childrens\", \"comedy\",\n",
    "            \"crime\", \"documentary\", \"drama\", \"fantasy\", \"filmNoir\", \"horror\",\n",
    "            \"musical\", \"mystery\", \"romance\", \"sciFi\", \"thriller\", \"war\", \"western\"\n",
    "        ], delimiter=\"|\")\n",
    "\n",
    "        base = [\"movieId\", \"title\", \"releaseDate\", \"videoReleaseDate\", \"IMDbURL\"]\n",
    "\n",
    "        genres = [\"unknown\", \"action\", \"adventure\", \"animation\", \"childrens\", \"comedy\",\n",
    "        \"crime\", \"documentary\", \"drama\", \"fantasy\", \"filmNoir\", \"horror\",\n",
    "        \"musical\", \"mystery\", \"romance\", \"sciFi\", \"thriller\", \"war\", \"western\"]\n",
    "\n",
    "        for i, row in enumerate(reader):\n",
    "            for genre in genres:\n",
    "                if row[genre] == '1':\n",
    "                    row[\"movieId\"] = int(row[\"movieId\"])\n",
    "                    new_row = {key: value for key, value in row.items() if key in base}| {\"genre\": genre}\n",
    "                    out.append(new_row)\n",
    "    return out\n",
    "\n",
    "\n",
    "def populate_movies_and_genres_txn(tx, rows):\n",
    "    query = \"\"\"\n",
    "            UNWIND $rows AS row\n",
    "            MERGE (m:Movie {\n",
    "                movieId: row.movieId\n",
    "            })\n",
    "            SET m.title = row.title,\n",
    "                m.releaseDate = row.releaseDate,\n",
    "                m.videoReleaseDate = row.videoReleaseDate,\n",
    "                m.IMDbURL = row.IMDbURL\n",
    "\n",
    "            MERGE (g:Genre { name: row.genre })\n",
    "\n",
    "            MERGE (m)-[:HAS_GENRE]->(g)\n",
    "        \"\"\"\n",
    "    try:\n",
    "        result = tx.run(query, rows=rows)\n",
    "        return result\n",
    "    except Exception as e:\n",
    "        raise e\n",
    "\n",
    "def create_movies_and_genres(driver: Driver):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        session.execute_write(\n",
    "            populate_movies_and_genres_txn,\n",
    "            read_items(r\"../data/ml-100k/u.item\")\n",
    "        )\n",
    "    return\n",
    "\n",
    "def read_data(csv_file_path):\n",
    "    with open(csv_file_path) as f:\n",
    "        reader = csv.DictReader(f, fieldnames=[\"userId\", \"movieId\", \"rating\", \"timestamp\"], dialect=\"excel-tab\")\n",
    "        out = []\n",
    "        for row in reader:\n",
    "            row[\"movieId\"] = int(row[\"movieId\"])\n",
    "            row[\"userId\"] = int(row[\"userId\"])\n",
    "            row[\"rating\"] = float(row[\"rating\"])\n",
    "            out.append(row)\n",
    "        return out\n",
    "\n",
    "def populate_data_txn(tx, rows):\n",
    "    query = \"\"\"\n",
    "    UNWIND $rows AS row\n",
    "\n",
    "    MATCH (u:User { userId: row.userId })\n",
    "    MATCH (m:Movie { movieId: row.movieId })\n",
    "\n",
    "    MERGE (u)-[r:RATED]->(m)\n",
    "    SET r.rating = row.rating,\n",
    "        r.timestamp = row.timestamp\n",
    "    \"\"\"\n",
    "    try:\n",
    "        result = tx.run(query, rows=rows)\n",
    "        return result\n",
    "    except Exception as e:\n",
    "        raise e\n",
    "\n",
    "def create_data(driver: Driver):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        session.execute_write(\n",
    "            populate_data_txn,\n",
    "            read_data(r\"../data/ml-100k/u.data\")\n",
    "        )\n",
    "    return\n",
    "\n",
    "\n",
    "def create_user_index_txn(tx):\n",
    "    query = \"\"\"\n",
    "    CREATE INDEX user_userId IF NOT EXISTS FOR (u:User) ON (u.userId)\n",
    "    \"\"\"\n",
    "    return tx.run(query)\n",
    "\n",
    "def create_movie_index_txn(tx):\n",
    "    query = \"\"\"\n",
    "    CREATE INDEX movie_movieId IF NOT EXISTS FOR (m:Movie) ON (m.movieId)\n",
    "    \"\"\"\n",
    "    return tx.run(query)\n",
    "\n",
    "def create_genre_index_txn(tx):\n",
    "    query = \"\"\"\n",
    "    CREATE INDEX genre_name IF NOT EXISTS FOR (g:Genre) ON (g.name)\n",
    "    \"\"\"\n",
    "    return tx.run(query)\n",
    "\n",
    "\n",
    "def create_index(driver):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        session.execute_write(\n",
    "           create_user_index_txn\n",
    "        )\n",
    "        session.execute_write(\n",
    "            create_movie_index_txn\n",
    "        )\n",
    "\n",
    "        session.execute_write(\n",
    "            create_genre_index_txn\n",
    "        )\n",
    "    return\n"
   ],
   "id": "456296ddae77e8ef",
   "outputs": [],
   "execution_count": 236
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T23:21:49.944664Z",
     "start_time": "2025-12-14T23:21:46.766060Z"
    }
   },
   "cell_type": "code",
   "source": [
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "try:\n",
    "    create_users(driver)\n",
    "    create_movies_and_genres(driver)\n",
    "    create_index(driver)\n",
    "    create_data(driver)\n",
    "except Exception as e:\n",
    "    raise e\n",
    "finally:\n",
    "    driver.close()"
   ],
   "id": "2982635c053df0cf",
   "outputs": [],
   "execution_count": 237
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T23:21:49.994129Z",
     "start_time": "2025-12-14T23:21:49.968830Z"
    }
   },
   "cell_type": "code",
   "source": [
    "import pandas as pd\n",
    "\n",
    "# find an appropriate high rating by looking at 1 standard deviation away from the average.\n",
    "df = pd.read_csv(r\"../data/ml-100k/u.data\", dialect=\"excel-tab\", names=[\"userId\", \"movieId\", \"rating\", \"timestamp\"])\n",
    "ratings: pd.Series = df[\"rating\"]\n",
    "\n",
    "high_rating = ratings.mean() + ratings.std()"
   ],
   "id": "87555527cef0b77",
   "outputs": [],
   "execution_count": 238
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T23:21:50.251237Z",
     "start_time": "2025-12-14T23:21:50.002338Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def graph_traversal(tx, userId, rating):\n",
    "    query = \"\"\"\n",
    "    WITH $userId AS targetUser, $rating AS ratingThreshold\n",
    "    MATCH (target:User {userId: targetUser})-[:RATED]->(m:Movie)\n",
    "    WITH target, collect(m) AS watched, ratingThreshold\n",
    "    MATCH (target)-[:RATED]->(common:Movie)<-[:RATED]-(similar:User)\n",
    "    WHERE target <> similar\n",
    "    MATCH (similar)-[r:RATED]->(rec:Movie)\n",
    "    WHERE NOT rec IN watched AND r.rating >= ratingThreshold\n",
    "    WITH rec, avg(r.rating) AS avgRating\n",
    "    RETURN rec.title AS movie, avgRating\n",
    "    ORDER BY avgRating DESC\n",
    "    LIMIT 10\n",
    "    \"\"\"\n",
    "    result = tx.run(query, userId=userId, rating=rating)\n",
    "    return [record.data() for record in result]\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "try:\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        reccs = session.execute_read(graph_traversal, 13, high_rating)\n",
    "        for rec in reccs:\n",
    "            print(rec)\n",
    "except Exception:\n",
    "    raise\n",
    "finally:\n",
    "    driver.close()"
   ],
   "id": "c5f0dbb33af825e1",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'movie': 'Shanghai Triad (Yao a yao yao dao waipo qiao) (1995)', 'avgRating': 5.0}\n",
      "{'movie': 'Richard III (1995)', 'avgRating': 5.0}\n",
      "{'movie': \"Mr. Holland's Opus (1995)\", 'avgRating': 5.0}\n",
      "{'movie': 'French Twist (Gazon maudit) (1995)', 'avgRating': 5.0}\n",
      "{'movie': 'White Balloon, The (1995)', 'avgRating': 5.0}\n",
      "{'movie': \"Antonia's Line (1995)\", 'avgRating': 5.0}\n",
      "{'movie': 'Angels and Insects (1995)', 'avgRating': 5.0}\n",
      "{'movie': 'Brothers McMullen, The (1995)', 'avgRating': 5.0}\n",
      "{'movie': 'Belle de jour (1967)', 'avgRating': 5.0}\n",
      "{'movie': 'Four Rooms (1995)', 'avgRating': 5.0}\n"
     ]
    }
   ],
   "execution_count": 239
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Question 2C: Find all triples of movies that share at least one genre and have been rated above the high-rating threshold by at least one user.",
   "id": "46569f47a24f54ef"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "The maximum amount of triangles we could have scales with the amount of movies. We could find that all the movies are highly rated and they all share the same genre, this could mean that we would have $\\binom{n}{3} = O(n^3)$ time complexity. This large run-rime makes the above query difficult to scale, so we are limiting our output to 100 triangles.",
   "id": "40125a57f0398a59"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T23:21:50.277377Z",
     "start_time": "2025-12-14T23:21:50.262936Z"
    }
   },
   "cell_type": "code",
   "source": [
    "df = pd.read_csv(r\"../data/ml-100k/u.item\", encoding=\"iso-8859-1\", delimiter=\"|\",\n",
    "                 names=[\"movieId\", \"title\", \"releaseDate\", \"videoReleaseDate\", \"IMDbURL\",\n",
    "                \"unknown\", \"action\", \"adventure\", \"animation\", \"childrens\", \"comedy\",\n",
    "                \"crime\", \"documentary\", \"drama\", \"fantasy\", \"filmNoir\", \"horror\",\n",
    "                \"musical\", \"mystery\", \"romance\", \"sciFi\", \"thriller\", \"war\", \"western\"])\n",
    "\n",
    "df[\"title\"].unique().shape"
   ],
   "id": "d63678f59ac0a053",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1664,)"
      ]
     },
     "execution_count": 240,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 240
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Which means that our maximum possible number of triangles is $\\binom{1644}{3} \\approx 7.4 \\times 10^8$.",
   "id": "3b3f7a3187024e4f"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T23:21:50.364278Z",
     "start_time": "2025-12-14T23:21:50.288970Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Counting the maximum for our data\n",
    "def count_movie_triangles(tx, rating_threshold):\n",
    "    query = \"\"\"\n",
    "    WITH $rating_threshold as ratingThreshold\n",
    "    MATCH (g:Genre)<-[:HAS_GENRE]-(m:Movie)<-[r:RATED]-(:User)\n",
    "    WHERE r.rating >= ratingThreshold\n",
    "    WITH g, count(m) AS n\n",
    "    WHERE n >= 3\n",
    "    RETURN g.name, n, (n*(n-1)*(n-2))/6 AS possibleTriples;\n",
    "    \"\"\"\n",
    "    result = tx.run(query, rating_threshold=rating_threshold)\n",
    "    return [record.data() for record in result]\n",
    "\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "try:\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        triangles: list[dict] = session.execute_read(count_movie_triangles, high_rating)\n",
    "        if not triangles:\n",
    "            print(\"no matches found\")\n",
    "        total = 0\n",
    "        for tri in triangles:\n",
    "            total += tri[\"possibleTriples\"]\n",
    "        print(\"total number of possible triangles is: \" + format(total, \",\"))\n",
    "except Exception:\n",
    "    raise\n",
    "finally:\n",
    "    driver.close()\n"
   ],
   "id": "a57129423e0422d5",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "total number of possible triangles is: 256,090,333,042\n"
     ]
    }
   ],
   "execution_count": 241
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T23:21:50.451550Z",
     "start_time": "2025-12-14T23:21:50.373898Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def find_movie_triangles(tx, rating_threshold):\n",
    "    query = \"\"\"\n",
    "    WITH $rating_threshold as ratingThreshold\n",
    "    MATCH (g:Genre)<-[:HAS_GENRE]-(m:Movie)<-[r:RATED]-(:User)\n",
    "    WHERE r.rating >= ratingThreshold\n",
    "    WITH g, collect(m) AS movies\n",
    "    WHERE size(movies) >= 3\n",
    "\n",
    "    UNWIND range(0, size(movies)-3) AS i\n",
    "    UNWIND range(i+1, size(movies)-2) AS j\n",
    "    UNWIND range(j+1, size(movies)-1) AS k\n",
    "\n",
    "    RETURN\n",
    "      g.name AS genre,\n",
    "      movies[i].title AS movie1,\n",
    "      movies[j].title AS movie2,\n",
    "      movies[k].title AS movie3\n",
    "    LIMIT 100\n",
    "    \"\"\"\n",
    "    result = tx.run(query, rating_threshold=rating_threshold)\n",
    "    return [record.data() for record in result]\n",
    "\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "try:\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        triangles: list[dict] = session.execute_read(find_movie_triangles, high_rating)\n",
    "        if not triangles:\n",
    "            print(\"no matches found\")\n",
    "        for tri in triangles:\n",
    "            pprint.pp(tri)\n",
    "except Exception:\n",
    "    raise\n",
    "finally:\n",
    "    driver.close()\n"
   ],
   "id": "90d575cd24d54f5b",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Cinema Paradiso (1988)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Bound (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Shawshank Redemption, The (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Eat Drink Man Woman (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Searching for Bobby Fischer (1993)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Ridicule (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Godfather, The (1972)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Fargo (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Breaking the Waves (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Gattaca (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Three Colors: Red (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Lone Star (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Three Colors: Blue (1993)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Professional, The (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Dead Poets Society (1989)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': '12 Angry Men (1957)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Postino, Il (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Dead Man Walking (1995)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Contact (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Empire Strikes Back, The (1980)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Chasing Amy (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Big Night (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Welcome to the Dollhouse (1995)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Swingers (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Henry V (1989)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Pillow Book, The (1995)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Dolores Claiborne (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Priest (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': \"Antonia's Line (1995)\"}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Remains of the Day, The (1993)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Cyrano de Bergerac (1990)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Manon of the Spring (Manon des sources) (1986)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Sling Blade (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Amadeus (1984)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Shanghai Triad (Yao a yao yao dao waipo qiao) (1995)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Jean de Florette (1986)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': \"Mr. Holland's Opus (1995)\"}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Horseman on the Roof, The (Hussard sur le toit, Le) (1995)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Godfather, The (1972)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Wings of the Dove, The (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Fargo (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Good Will Hunting (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Secrets & Lies (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'As Good As It Gets (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Emma (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Titanic (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Sense and Sensibility (1995)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Boogie Nights (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Jackie Brown (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Wag the Dog (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Contact (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': \"Ulee's Gold (1997)\"}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Cop Land (1997)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Desperate Measures (1998)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'This Is Spinal Tap (1984)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Fargo (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Adventures of Priscilla, Queen of the Desert, The (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Empire Strikes Back, The (1980)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Cool Hand Luke (1967)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Big Night (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Postino, Il (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': '2001: A Space Odyssey (1968)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Three Colors: Red (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Casablanca (1942)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Silence of the Lambs, The (1991)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Godfather, The (1972)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Down by Law (1986)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Like Water For Chocolate (Como agua para chocolate) (1992)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Apartment, The (1960)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': \"Breakfast at Tiffany's (1961)\"}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Citizen Kane (1941)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Short Cuts (1993)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Trainspotting (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Graduate, The (1967)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Fargo (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Wizard of Oz, The (1939)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Jean de Florette (1986)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Mr. Smith Goes to Washington (1939)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Lone Star (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'East of Eden (1955)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Magnificent Seven, The (1954)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Christmas Carol, A (1938)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Apollo 13 (1995)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Lost Horizon (1937)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Dolores Claiborne (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'East of Eden (1955)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Miracle on 34th Street (1994)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Babe (1995)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Platoon (1986)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'On Golden Pond (1981)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Streetcar Named Desire, A (1951)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Glory (1989)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Amadeus (1984)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Secrets & Lies (1996)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Killing Fields, The (1984)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Right Stuff, The (1983)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Godfather, The (1972)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Apocalypse Now (1979)'}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': \"One Flew Over the Cuckoo's Nest (1975)\"}\n",
      "{'genre': 'drama',\n",
      " 'movie1': 'Graduate, The (1967)',\n",
      " 'movie2': 'Chasing Amy (1997)',\n",
      " 'movie3': 'Braveheart (1995)'}\n"
     ]
    }
   ],
   "execution_count": 242
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "2D) Compute movie similarity via genre overlap. We want to create or modify edges in the graph to capture similar movies based on shared genres. You can compute a `genreScore` based on the number of common genres between two movies. You need to specify a threshold for `genreScore`. You can run exploratory queries to identify how many movies share 2, 3, 4 or more genres, and pick the threshold based on the percentage of movies sharing genres. You may want want to note that most movies share at elast one genre; thus, having a proper threshold helps to control density and filter out noisy edges. At the end we want the database to have relationships like `(:Title)-[:SIMILAR_TO] {genreScore: ...}]->(:Title)`",
   "id": "1ccf6450202e5c50"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T23:21:50.947064Z",
     "start_time": "2025-12-14T23:21:50.476573Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def find_pairs(tx):\n",
    "    query = \"\"\"\n",
    "    MATCH (m1:Movie)-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(m2:Movie)\n",
    "    WHERE m1.movieId < m2.movieId\n",
    "    WITH m1, m2, count(DISTINCT g) AS genreScore\n",
    "    RETURN genreScore, count(*) AS numMoviePairs\n",
    "    \"\"\"\n",
    "    result = tx.run(query)\n",
    "    return [record.data() for record in result]\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "\n",
    "def find_genre_percentiles(d):\n",
    "    try:\n",
    "        with d.session(database=\"neo4j\") as session:\n",
    "            pairs: list[dict] = session.execute_read(find_pairs)\n",
    "            if not pairs:\n",
    "                print(\"no matches found\")\n",
    "            df = pd.DataFrame(pairs).sort_values(by=[\"genreScore\"])\n",
    "            n = df[\"numMoviePairs\"]\n",
    "            df[\"percentiles\"] = (n/n.sum())*100\n",
    "            print(df)\n",
    "    except Exception:\n",
    "        raise\n",
    "    finally:\n",
    "        d.close()\n",
    "\n",
    "find_genre_percentiles(driver)\n"
   ],
   "id": "21bae6ee9f028d0a",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   genreScore  numMoviePairs  percentiles\n",
      "1           1         458002    93.509681\n",
      "0           2          30230     6.172020\n",
      "2           3           1512     0.308703\n",
      "3           4             44     0.008983\n",
      "4           5              3     0.000613\n"
     ]
    }
   ],
   "execution_count": 243
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "So from the above we can see that 93.5% of movies share one genre, 6% share 2 and less than a percentage for the rest. So will define `genreScoreThreshold = 2`",
   "id": "b82250437142365"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T23:21:51.942660Z",
     "start_time": "2025-12-14T23:21:50.968730Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def create_similar_to(tx, genre_score_threshold):\n",
    "    query = \"\"\"\n",
    "    WITH $genreScoreThreshold AS genreScoreThreshold\n",
    "    MATCH (m1:Movie)-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(m2:Movie)\n",
    "    WHERE m1.movieId < m2.movieId\n",
    "    WITH m1, m2, count(DISTINCT g) AS genreScore\n",
    "    WHERE genreScore >= 2\n",
    "    MERGE (m1)-[s:SIMILAR_TO]->(m2)\n",
    "    SET s.genreScore = genreScore;\n",
    "    \"\"\"\n",
    "    tx.run(query, genreScoreThreshold=genre_score_threshold)\n",
    "    return\n",
    "\n",
    "def read_similar_to(tx):\n",
    "    query = \"\"\"\n",
    "    MATCH p=()-[r:SIMILAR_TO]->() RETURN p LIMIT 25\n",
    "    \"\"\"\n",
    "    result = tx.run(query)\n",
    "    return [record.data() for record in result]\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "try:\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        session.execute_write(create_similar_to, genre_score_threshold=2)\n",
    "        matches = session.execute_read(read_similar_to)\n",
    "        if not matches:\n",
    "            raise ValueError(\"No values found\")\n",
    "        for i in matches:\n",
    "            pprint.pp(i)\n",
    "except Exception:\n",
    "    raise\n",
    "finally:\n",
    "    driver.close()\n"
   ],
   "id": "ba2d1b5e6608b3e3",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'p': [{'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Toy%20Story%20(1995)',\n",
      "        'movieId': 1,\n",
      "        'title': 'Toy Story (1995)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Aristocats,%20The%20(1970)',\n",
      "        'releaseDate': '01-Jan-1970',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 102,\n",
      "        'title': 'Aristocats, The (1970)'}]}\n",
      "{'p': [{'releaseDate': '01-Jan-1992',\n",
      "        'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Aladdin%20(1992)',\n",
      "        'movieId': 95,\n",
      "        'title': 'Aladdin (1992)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Aristocats,%20The%20(1970)',\n",
      "        'releaseDate': '01-Jan-1970',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 102,\n",
      "        'title': 'Aristocats, The (1970)'}]}\n",
      "{'p': [{'IMDbURL': 'http://us.imdb.com/M/title-exact?Lion%20King,%20The%20(1994)',\n",
      "        'releaseDate': '01-Jan-1994',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 71,\n",
      "        'title': 'Lion King, The (1994)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Aristocats,%20The%20(1970)',\n",
      "        'releaseDate': '01-Jan-1970',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 102,\n",
      "        'title': 'Aristocats, The (1970)'}]}\n",
      "{'p': [{'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Snow%20White%20and%20the%20Seven%20Dwarfs%20(1937)',\n",
      "        'releaseDate': '01-Jan-1937',\n",
      "        'movieId': 99,\n",
      "        'title': 'Snow White and the Seven Dwarfs (1937)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Aristocats,%20The%20(1970)',\n",
      "        'releaseDate': '01-Jan-1970',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 102,\n",
      "        'title': 'Aristocats, The (1970)'}]}\n",
      "{'p': [{'IMDbURL': 'http://us.imdb.com/M/title-exact?Aristocats,%20The%20(1970)',\n",
      "        'releaseDate': '01-Jan-1970',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 102,\n",
      "        'title': 'Aristocats, The (1970)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'IMDbURL': \"http://us.imdb.com/M/title-exact?Pete's%20Dragon%20(1977)\",\n",
      "        'releaseDate': '01-Jan-1977',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1091,\n",
      "        'title': \"Pete's Dragon (1977)\"},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Toy%20Story%20(1995)',\n",
      "        'movieId': 1,\n",
      "        'title': 'Toy Story (1995)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Hunchback%20of%20Notre%20Dame,%20The%20(1996)',\n",
      "        'releaseDate': '21-Jun-1996',\n",
      "        'movieId': 596,\n",
      "        'title': 'Hunchback of Notre Dame, The (1996)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'IMDbURL': 'http://us.imdb.com/M/title-exact?Pagemaster,%20The%20(1994)',\n",
      "        'releaseDate': '01-Jan-1994',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1076,\n",
      "        'title': 'Pagemaster, The (1994)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?James%20and%20the%20Giant%20Peach%20(1996)',\n",
      "        'releaseDate': '12-Apr-1996',\n",
      "        'movieId': 473,\n",
      "        'title': 'James and the Giant Peach (1996)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'releaseDate': '15-Nov-1996',\n",
      "        'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Space%20Jam%20(1996)',\n",
      "        'movieId': 820,\n",
      "        'title': 'Space Jam (1996)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?All%20Dogs%20Go%20to%20Heaven%202%20(1996)',\n",
      "        'releaseDate': '29-Mar-1996',\n",
      "        'movieId': 103,\n",
      "        'title': 'All Dogs Go to Heaven 2 (1996)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'releaseDate': '27-Jun-1997',\n",
      "        'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Hercules+(1997)',\n",
      "        'movieId': 993,\n",
      "        'title': 'Hercules (1997)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'releaseDate': '01-Jan-1950',\n",
      "        'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Cinderella%20(1950)',\n",
      "        'movieId': 418,\n",
      "        'title': 'Cinderella (1950)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'releaseDate': '01-Jan-1992',\n",
      "        'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Aladdin%20(1992)',\n",
      "        'movieId': 95,\n",
      "        'title': 'Aladdin (1992)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'releaseDate': '01-Jan-1941',\n",
      "        'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Dumbo%20(1941)',\n",
      "        'movieId': 501,\n",
      "        'title': 'Dumbo (1941)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Beavis%20and%20Butt-head%20Do%20America%20(1996)',\n",
      "        'releaseDate': '20-Dec-1996',\n",
      "        'movieId': 240,\n",
      "        'title': 'Beavis and Butt-head Do America (1996)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'IMDbURL': 'http://us.imdb.com/M/title-exact?Alice%20in%20Wonderland%20(1951)',\n",
      "        'releaseDate': '01-Jan-1951',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 420,\n",
      "        'title': 'Alice in Wonderland (1951)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'releaseDate': '01-Jan-1940',\n",
      "        'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Fantasia%20(1940)',\n",
      "        'movieId': 432,\n",
      "        'title': 'Fantasia (1940)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'IMDbURL': 'http://us.imdb.com/M/title-exact?Grand%20Day%20Out,%20A%20(1992)',\n",
      "        'releaseDate': '01-Jan-1992',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 189,\n",
      "        'title': 'Grand Day Out, A (1992)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'IMDbURL': 'http://us.imdb.com/M/title-exact?Close%20Shave,%20A%20(1995)',\n",
      "        'releaseDate': '28-Apr-1996',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 408,\n",
      "        'title': 'Close Shave, A (1995)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Sword%20in%20the%20Stone,%20The%20(1963)',\n",
      "        'releaseDate': '01-Jan-1963',\n",
      "        'movieId': 625,\n",
      "        'title': 'Sword in the Stone, The (1963)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'IMDbURL': 'http://us.imdb.com/M/title-exact?Cats%20Don%27t%20Dance%20(1997)',\n",
      "        'releaseDate': '26-Mar-1997',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 989,\n",
      "        'title': \"Cats Don't Dance (1997)\"},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'IMDbURL': 'http://us.imdb.com/M/title-exact?Oliver%20&%20Company%20(1988)',\n",
      "        'releaseDate': '29-Mar-1988',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1078,\n",
      "        'title': 'Oliver & Company (1988)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n",
      "{'p': [{'releaseDate': '01-Jan-1997',\n",
      "        'videoReleaseDate': '',\n",
      "        'IMDbURL': 'http://us.imdb.com/M/title-exact?Anastasia+(1997)',\n",
      "        'movieId': 538,\n",
      "        'title': 'Anastasia (1997)'},\n",
      "       'SIMILAR_TO',\n",
      "       {'IMDbURL': 'http://us.imdb.com/M/title-exact?Goofy%20Movie,%20A%20(1995)',\n",
      "        'releaseDate': '01-Jan-1995',\n",
      "        'videoReleaseDate': '',\n",
      "        'movieId': 1219,\n",
      "        'title': 'Goofy Movie, A (1995)'}]}\n"
     ]
    }
   ],
   "execution_count": 244
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
