{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2025-12-11T08:01:50.504445Z",
     "start_time": "2025-12-11T08:01:50.488088Z"
    }
   },
   "source": [
    "from typing import TextIO\n",
    "import csv\n",
    "import pprint\n",
    "from secret import NEO4J_PASSWORD\n",
    "\n",
    "from neo4j import GraphDatabase, Driver\n",
    "\n",
    "URI = \"neo4j://localhost\"\n",
    "AUTH = (\"neo4j\", NEO4J_PASSWORD)\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n"
   ],
   "outputs": [],
   "execution_count": 142
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-11T08:01:50.521234Z",
     "start_time": "2025-12-11T08:01:50.514520Z"
    }
   },
   "cell_type": "code",
   "source": [
    "with open(r\"../data/ml-100k/u.item\") as file:\n",
    "    for i, item in enumerate(csv.reader(file, delimiter=\"|\")):\n",
    "        pprint.pprint(item, compact=True)\n",
    "        if i >= 10:\n",
    "            break"
   ],
   "id": "d5e2ccc7908a8516",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['1', 'Toy Story (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Toy%20Story%20(1995)', '0', '0', '0', '1',\n",
      " '1', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0']\n",
      "['2', 'GoldenEye (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?GoldenEye%20(1995)', '0', '1', '1', '0', '0',\n",
      " '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0']\n",
      "['3', 'Four Rooms (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Four%20Rooms%20(1995)', '0', '0', '0', '0',\n",
      " '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0']\n",
      "['4', 'Get Shorty (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Get%20Shorty%20(1995)', '0', '1', '0', '0',\n",
      " '0', '1', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0']\n",
      "['5', 'Copycat (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Copycat%20(1995)', '0', '0', '0', '0', '0',\n",
      " '0', '1', '0', '1', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0']\n",
      "['6', 'Shanghai Triad (Yao a yao yao dao waipo qiao) (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/Title?Yao+a+yao+yao+dao+waipo+qiao+(1995)', '0', '0', '0',\n",
      " '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0',\n",
      " '0']\n",
      "['7', 'Twelve Monkeys (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Twelve%20Monkeys%20(1995)', '0', '0', '0',\n",
      " '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '1', '0', '0',\n",
      " '0']\n",
      "['8', 'Babe (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Babe%20(1995)', '0', '0', '0', '0', '1', '1',\n",
      " '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0']\n",
      "['9', 'Dead Man Walking (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Dead%20Man%20Walking%20(1995)', '0', '0',\n",
      " '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0',\n",
      " '0']\n",
      "['10', 'Richard III (1995)', '22-Jan-1996', '',\n",
      " 'http://us.imdb.com/M/title-exact?Richard%20III%20(1995)', '0', '0', '0', '0',\n",
      " '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0']\n",
      "['11', 'Seven (Se7en) (1995)', '01-Jan-1995', '',\n",
      " 'http://us.imdb.com/M/title-exact?Se7en%20(1995)', '0', '0', '0', '0', '0',\n",
      " '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0']\n"
     ]
    }
   ],
   "execution_count": 143
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-11T08:01:50.545542Z",
     "start_time": "2025-12-11T08:01:50.534622Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def open_file(csv_file_path: str) -> TextIO:\n",
    "    with open(csv_file_path, encoding=\"utf-8\") as f:\n",
    "        return f\n",
    "\n",
    "def read_user(csv_file_path):\n",
    "    out = []\n",
    "    with open(csv_file_path, encoding=\"utf-8\") as f:\n",
    "        reader = csv.DictReader(f,fieldnames=[\"userId\", \"age\", \"gender\", \"occupation\", \"zipCode\"] ,delimiter=\"|\")\n",
    "        for i, row in enumerate(reader):\n",
    "            row[\"userId\"] = int(row[\"userId\"])\n",
    "            out.append(row)\n",
    "    return out\n",
    "\n",
    "def populate_user_txn(tx, rows):\n",
    "    query = \"\"\"\n",
    "    UNWIND $users as user\n",
    "    CREATE (Person:User {\n",
    "    userId: user.userId,\n",
    "    age: user.age,\n",
    "    gender: user.gender,\n",
    "    occupation: user.occupation,\n",
    "    zipCode: user.zipCode})\n",
    "    \"\"\"\n",
    "    try:\n",
    "        tx.run(query, users=rows)\n",
    "    except Exception as e:\n",
    "        raise e\n",
    "\n",
    "def create_users(driver: Driver):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        session.execute_write(\n",
    "            populate_user_txn,\n",
    "            read_user(r\"../data/ml-100k/u.user\")\n",
    "        )\n",
    "    return\n",
    "\n",
    "\n",
    "def populate_occupation_tnx(tx, rows):\n",
    "    query = \"\"\"\n",
    "    UNWIND $occupations as occupation\n",
    "    CREATE (:Occupation {\n",
    "    occupation: occupation.occupation,\n",
    "    })\n",
    "    \"\"\"\n",
    "    try:\n",
    "        tx.run(query, occupation=rows)\n",
    "    except Exception as e:\n",
    "        raise e\n",
    "\n",
    "def read_items(csv_file_path):\n",
    "    out = []\n",
    "    with open(csv_file_path, encoding=\"iso-8859-1\") as f:\n",
    "\n",
    "        reader = csv.DictReader(f, fieldnames= [\n",
    "            \"movieId\", \"title\", \"releaseDate\", \"videoReleaseDate\", \"IMDbURL\",\n",
    "            \"unknown\", \"action\", \"adventure\", \"animation\", \"childrens\", \"comedy\",\n",
    "            \"crime\", \"documentary\", \"drama\", \"fantasy\", \"filmNoir\", \"horror\",\n",
    "            \"musical\", \"mystery\", \"romance\", \"sciFi\", \"thriller\", \"war\", \"western\"\n",
    "        ], delimiter=\"|\")\n",
    "\n",
    "        base = [\"movieId\", \"title\", \"releaseDate\", \"videoReleaseDate\", \"IMDbURL\"]\n",
    "\n",
    "        genres = [\"unknown\", \"action\", \"adventure\", \"animation\", \"childrens\", \"comedy\",\n",
    "        \"crime\", \"documentary\", \"drama\", \"fantasy\", \"filmNoir\", \"horror\",\n",
    "        \"musical\", \"mystery\", \"romance\", \"sciFi\", \"thriller\", \"war\", \"western\"]\n",
    "\n",
    "        for i, row in enumerate(reader):\n",
    "            for genre in genres:\n",
    "                if row[genre] == '1':\n",
    "                    row[\"movieId\"] = int(row[\"movieId\"])\n",
    "                    new_row = {key: value for key, value in row.items() if key in base}| {\"genre\": genre}\n",
    "                    out.append(new_row)\n",
    "    return out\n",
    "\n",
    "\n",
    "def populate_movies_and_genres_txn(tx, rows):\n",
    "    query = \"\"\"\n",
    "            UNWIND $rows AS row\n",
    "            MERGE (m:Movie {\n",
    "                movieId: row.movieId\n",
    "            })\n",
    "            SET m.title = row.title,\n",
    "                m.releaseDate = row.releaseDate,\n",
    "                m.videoReleaseDate = row.videoReleaseDate,\n",
    "                m.IMDbURL = row.IMDbURL\n",
    "\n",
    "            MERGE (g:Genre { name: row.genre })\n",
    "\n",
    "            MERGE (m)-[:HAS_GENRE]->(g)\n",
    "        \"\"\"\n",
    "    try:\n",
    "        result = tx.run(query, rows=rows)\n",
    "        return result\n",
    "    except Exception as e:\n",
    "        raise e\n",
    "\n",
    "def create_movies_and_genres(driver: Driver):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        session.execute_write(\n",
    "            populate_movies_and_genres_txn,\n",
    "            read_items(r\"../data/ml-100k/u.item\")\n",
    "        )\n",
    "    return\n",
    "\n",
    "def read_data(csv_file_path):\n",
    "    with open(csv_file_path) as f:\n",
    "        reader = csv.DictReader(f, fieldnames=[\"userId\", \"movieId\", \"rating\", \"timestamp\"], dialect=\"excel-tab\")\n",
    "        out = []\n",
    "        for row in reader:\n",
    "            row[\"movieId\"] = int(row[\"movieId\"])\n",
    "            row[\"userId\"] = int(row[\"userId\"])\n",
    "            row[\"rating\"] = float(row[\"rating\"])\n",
    "            out.append(row)\n",
    "        return out\n",
    "\n",
    "def populate_data_txn(tx, rows):\n",
    "    query = \"\"\"\n",
    "    UNWIND $rows AS row\n",
    "\n",
    "    MATCH (u:User { userId: row.userId })\n",
    "    MATCH (m:Movie { movieId: row.movieId })\n",
    "\n",
    "    MERGE (u)-[r:RATED]->(m)\n",
    "    SET r.rating = row.rating,\n",
    "        r.timestamp = row.timestamp\n",
    "    \"\"\"\n",
    "    try:\n",
    "        result = tx.run(query, rows=rows)\n",
    "        return result\n",
    "    except Exception as e:\n",
    "        raise e\n",
    "\n",
    "def create_data(driver: Driver):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        session.execute_write(\n",
    "            populate_data_txn,\n",
    "            read_data(r\"../data/ml-100k/u.data\")\n",
    "        )\n",
    "    return\n",
    "\n",
    "\n",
    "def create_user_index_txn(tx):\n",
    "    query = \"\"\"\n",
    "    CREATE INDEX user_userId IF NOT EXISTS FOR (u:User) ON (u.userId)\n",
    "    \"\"\"\n",
    "    return tx.run(query)\n",
    "\n",
    "def create_movie_index_txn(tx):\n",
    "    query = \"\"\"\n",
    "    CREATE INDEX movie_movieId IF NOT EXISTS FOR (m:Movie) ON (m.movieId)\n",
    "    \"\"\"\n",
    "    return tx.run(query)\n",
    "\n",
    "def create_genre_index_txn(tx):\n",
    "    query = \"\"\"\n",
    "    CREATE INDEX genre_name IF NOT EXISTS FOR (g:Genre) ON (g.name)\n",
    "    \"\"\"\n",
    "    return tx.run(query)\n",
    "\n",
    "\n",
    "def create_index(driver):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        session.execute_write(\n",
    "           create_user_index_txn\n",
    "        )\n",
    "        session.execute_write(\n",
    "            create_movie_index_txn\n",
    "        )\n",
    "\n",
    "        session.execute_write(\n",
    "            create_genre_index_txn\n",
    "        )\n",
    "    return\n"
   ],
   "id": "456296ddae77e8ef",
   "outputs": [],
   "execution_count": 144
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-11T08:01:53.710262Z",
     "start_time": "2025-12-11T08:01:50.553601Z"
    }
   },
   "cell_type": "code",
   "source": [
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "try:\n",
    "    create_users(driver)\n",
    "    create_movies_and_genres(driver)\n",
    "    create_index(driver)\n",
    "    create_data(driver)\n",
    "except Exception as e:\n",
    "    raise e\n",
    "finally:\n",
    "    driver.close()"
   ],
   "id": "2982635c053df0cf",
   "outputs": [],
   "execution_count": 145
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-13T20:51:37.171522Z",
     "start_time": "2025-12-13T20:51:37.151539Z"
    }
   },
   "cell_type": "code",
   "source": [
    "import pandas as pd\n",
    "\n",
    "# find an appropriate high rating by looking at 1 standard deviation away from the average.\n",
    "df = pd.read_csv(r\"../data/ml-100k/u.data\", dialect=\"excel-tab\", names=[\"userId\", \"movieId\", \"rating\", \"timestamp\"])\n",
    "ratings: pd.Series = df[\"rating\"]\n",
    "\n",
    "high_rating = ratings.mean() + ratings.std()"
   ],
   "id": "87555527cef0b77",
   "outputs": [],
   "execution_count": 176
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-13T20:51:39.092591Z",
     "start_time": "2025-12-13T20:51:38.773474Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def graph_traversal(tx, userId, rating):\n",
    "    query = \"\"\"\n",
    "    WITH $userId AS targetUser, $rating AS ratingThreshold\n",
    "    MATCH (target:User {userId: targetUser})-[:RATED]->(m:Movie)\n",
    "    WITH target, collect(m) AS watched, ratingThreshold\n",
    "    MATCH (target)-[:RATED]->(common:Movie)<-[:RATED]-(similar:User)\n",
    "    WHERE target <> similar\n",
    "    MATCH (similar)-[r:RATED]->(rec:Movie)\n",
    "    WHERE NOT rec IN watched AND r.rating >= ratingThreshold\n",
    "    WITH rec, avg(r.rating) AS avgRating\n",
    "    RETURN rec.title AS movie, avgRating\n",
    "    ORDER BY avgRating DESC\n",
    "    LIMIT 10\n",
    "    \"\"\"\n",
    "    result = tx.run(query, userId=userId, rating=rating)\n",
    "    return [record.data() for record in result]\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "try:\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        reccs = session.execute_read(graph_traversal, 13, high_rating)\n",
    "        for rec in reccs:\n",
    "            print(rec)\n",
    "except Exception:\n",
    "    raise\n",
    "finally:\n",
    "    driver.close()"
   ],
   "id": "c5f0dbb33af825e1",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'movie': 'Shanghai Triad (Yao a yao yao dao waipo qiao) (1995)', 'avgRating': 5.0}\n",
      "{'movie': 'Richard III (1995)', 'avgRating': 5.0}\n",
      "{'movie': \"Mr. Holland's Opus (1995)\", 'avgRating': 5.0}\n",
      "{'movie': 'French Twist (Gazon maudit) (1995)', 'avgRating': 5.0}\n",
      "{'movie': 'White Balloon, The (1995)', 'avgRating': 5.0}\n",
      "{'movie': \"Antonia's Line (1995)\", 'avgRating': 5.0}\n",
      "{'movie': 'Angels and Insects (1995)', 'avgRating': 5.0}\n",
      "{'movie': 'Brothers McMullen, The (1995)', 'avgRating': 5.0}\n",
      "{'movie': 'Belle de jour (1967)', 'avgRating': 5.0}\n",
      "{'movie': 'Four Rooms (1995)', 'avgRating': 5.0}\n"
     ]
    }
   ],
   "execution_count": 177
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Question 2C: Find all triples of movies that share at least one genre and have been rated above the high-rating threshold by at least one user.",
   "id": "46569f47a24f54ef"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "The maximum amount of triangles we could have scales with the amount of movies. We could find that all the movies are highly rated and they all share the same genre, this could mean that we would have $\\binom{n}{3} = O(n^3)$ time complexity. This large run-rime makes the above query difficult to scale, so we are limiting our output to 100 triangles.",
   "id": "40125a57f0398a59"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T00:10:00.920972Z",
     "start_time": "2025-12-14T00:10:00.909244Z"
    }
   },
   "cell_type": "code",
   "source": [
    "df = pd.read_csv(r\"../data/ml-100k/u.item\", encoding=\"iso-8859-1\", delimiter=\"|\",\n",
    "                 names=[\"movieId\", \"title\", \"releaseDate\", \"videoReleaseDate\", \"IMDbURL\",\n",
    "                \"unknown\", \"action\", \"adventure\", \"animation\", \"childrens\", \"comedy\",\n",
    "                \"crime\", \"documentary\", \"drama\", \"fantasy\", \"filmNoir\", \"horror\",\n",
    "                \"musical\", \"mystery\", \"romance\", \"sciFi\", \"thriller\", \"war\", \"western\"])\n",
    "\n",
    "df[\"title\"].unique().shape"
   ],
   "id": "d63678f59ac0a053",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(1664,)"
      ]
     },
     "execution_count": 189,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 189
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Which means that our maximum possible number of triangles is $\\binom{1644}{3} \\approx 7.4 \\times 10^8$.",
   "id": "3b3f7a3187024e4f"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T14:25:37.154246Z",
     "start_time": "2025-12-14T14:25:37.098450Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Counting the maximum for our data\n",
    "def count_movie_triangles(tx, rating_threshold):\n",
    "    query = \"\"\"\n",
    "    WITH $rating_threshold as ratingThreshold\n",
    "    MATCH (g:Genre)<-[:HAS_GENRE]-(m:Movie)<-[r:RATED]-(:User)\n",
    "    WHERE r.rating >= ratingThreshold\n",
    "    WITH g, count(m) AS n\n",
    "    WHERE n >= 3\n",
    "    RETURN g.name, n, (n*(n-1)*(n-2))/6 AS possibleTriples;\n",
    "    \"\"\"\n",
    "    result = tx.run(query, rating_threshold=rating_threshold)\n",
    "    return [record.data() for record in result]\n",
    "\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "try:\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        triangles: list[dict] = session.execute_read(count_movie_triangles, high_rating)\n",
    "        if not triangles:\n",
    "            print(\"no matches found\")\n",
    "        total = 0\n",
    "        for tri in triangles:\n",
    "            total += tri[\"possibleTriples\"]\n",
    "        print(\"total number of possible triangles is: \" + format(total, \",\"))\n",
    "except Exception:\n",
    "    raise\n",
    "finally:\n",
    "    driver.close()\n"
   ],
   "id": "a57129423e0422d5",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "total number of possible triangles is: 256,090,333,042\n"
     ]
    }
   ],
   "execution_count": 205
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T14:20:09.946872Z",
     "start_time": "2025-12-14T14:20:09.873826Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def find_movie_triangles(tx, rating_threshold):\n",
    "    query = \"\"\"\n",
    "    WITH $rating_threshold as ratingThreshold\n",
    "    MATCH (g:Genre)<-[:HAS_GENRE]-(m:Movie)<-[r:RATED]-(:User)\n",
    "    WHERE r.rating >= ratingThreshold\n",
    "    WITH g, collect(m) AS movies\n",
    "    WHERE size(movies) >= 3\n",
    "\n",
    "    UNWIND range(0, size(movies)-3) AS i\n",
    "    UNWIND range(i+1, size(movies)-2) AS j\n",
    "    UNWIND range(j+1, size(movies)-1) AS k\n",
    "\n",
    "    RETURN\n",
    "      g.name AS genre,\n",
    "      movies[i].title AS movie1,\n",
    "      movies[j].title AS movie2,\n",
    "      movies[k].title AS movie3\n",
    "    LIMIT 100\n",
    "    \"\"\"\n",
    "    result = tx.run(query, rating_threshold=rating_threshold)\n",
    "    return [record.data() for record in result]\n",
    "\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "try:\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        triangles: list[dict] = session.execute_read(find_movie_triangles, high_rating)\n",
    "        if not triangles:\n",
    "            print(\"no matches found\")\n",
    "        for tri in triangles:\n",
    "            pprint.pp(tri)\n",
    "except Exception:\n",
    "    raise\n",
    "finally:\n",
    "    driver.close()\n"
   ],
   "id": "90d575cd24d54f5b",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Mars Attacks! (1996)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Trek: The Wrath of Khan (1982)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Wars (1977)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Godfather, The (1972)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Aliens (1986)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Good, The Bad and The Ugly, The (1966)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Terminator, The (1984)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Terminator 2: Judgment Day (1991)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Cyrano de Bergerac (1990)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Raiders of the Lost Ark (1981)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Alien (1979)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Return of the Jedi (1983)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Princess Bride, The (1987)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Wars (1977)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Titanic (1997)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Godfather, The (1972)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Conspiracy Theory (1997)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Wars (1977)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Air Force One (1997)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Blues Brothers 2000 (1998)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Men in Black (1997)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Heavy Metal (1981)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Empire Strikes Back, The (1980)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Raiders of the Lost Ark (1981)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Return of the Jedi (1983)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Blues Brothers, The (1980)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Trek: The Wrath of Khan (1982)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Princess Bride, The (1987)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Godfather, The (1972)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Jaws (1975)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Princess Bride, The (1987)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'U Turn (1997)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Speed (1994)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Braveheart (1995)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Apollo 13 (1995)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Terminator 2: Judgment Day (1991)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Conan the Barbarian (1981)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Glory (1989)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Wars (1977)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Natural Born Killers (1994)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Heavy Metal (1981)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Cliffhanger (1993)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Abyss, The (1989)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'African Queen, The (1951)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'True Romance (1993)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Ben-Hur (1959)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Adventures of Robin Hood, The (1938)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Jaws 2 (1978)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Magnificent Seven, The (1954)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Get Shorty (1995)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Terminator, The (1984)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Quick and the Dead, The (1995)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Godfather, The (1972)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Independence Day (ID4) (1996)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Strange Days (1995)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Full Metal Jacket (1987)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Butch Cassidy and the Sundance Kid (1969)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Raiders of the Lost Ark (1981)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Die Hard (1988)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Hunt for Red October, The (1990)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'True Lies (1994)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Die Hard 2 (1990)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Trek III: The Search for Spock (1984)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Braveheart (1995)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Godfather, The (1972)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Trek: First Contact (1996)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Full Metal Jacket (1987)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Butch Cassidy and the Sundance Kid (1969)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Alien (1979)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Raiders of the Lost Ark (1981)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Glory (1989)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Jurassic Park (1993)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Aliens (1986)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Empire Strikes Back, The (1980)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Trek: The Wrath of Khan (1982)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Die Hard (1988)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Wars (1977)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Terminator, The (1984)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Evil Dead II (1987)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'True Lies (1994)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Wars (1977)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Face/Off (1997)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'African Queen, The (1951)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Godfather, The (1972)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Butch Cassidy and the Sundance Kid (1969)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Magnificent Seven, The (1954)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Braveheart (1995)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Alien (1979)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Star Wars (1977)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Princess Bride, The (1987)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Apollo 13 (1995)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Get Shorty (1995)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Raiders of the Lost Ark (1981)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Apollo 13 (1995)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Top Gun (1986)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'In the Line of Fire (1993)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Independence Day (ID4) (1996)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Return of the Jedi (1983)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Steel (1997)'}\n",
      "{'genre': 'action',\n",
      " 'movie1': 'Empire Strikes Back, The (1980)',\n",
      " 'movie2': 'Jurassic Park (1993)',\n",
      " 'movie3': 'Desperado (1995)'}\n"
     ]
    }
   ],
   "execution_count": 203
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "2D) Compute movie similarity via genre overlap. We want to create or modify edges in the graph to capture similar movies based on shared genres. You can compute a `genreScore` based on the number of common genres between two movies. You need to specify a threshold for `genreScore`. You can run exploratory queries to identify how many movies share 2, 3, 4 or more genres, and pick the threshold based on the percentage of movies sharing genres. You may want want to note that most movies share at elast one genre; thus, having a proper threshold helps to control density and filter out noisy edges. At the end we want the database to have relationships like `(:Title)-[:SIMILAR_TO] {genreScore: ...}]->(:Title)`",
   "id": "1ccf6450202e5c50"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T18:07:15.215350Z",
     "start_time": "2025-12-14T18:07:14.713992Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def find_pairs(tx):\n",
    "    query = \"\"\"\n",
    "    MATCH (m1:Movie)-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(m2:Movie)\n",
    "    WHERE m1.movieId < m2.movieId\n",
    "    WITH m1, m2, count(DISTINCT g) AS genreScore\n",
    "    RETURN genreScore, count(*) AS numMoviePairs\n",
    "    \"\"\"\n",
    "    result = tx.run(query)\n",
    "    return [record.data() for record in result]\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "\n",
    "def find_genre_percentiles(d):\n",
    "    try:\n",
    "        with d.session(database=\"neo4j\") as session:\n",
    "            pairs: list[dict] = session.execute_read(find_pairs)\n",
    "            if not pairs:\n",
    "                print(\"no matches found\")\n",
    "            df = pd.DataFrame(pairs).sort_values(by=[\"genreScore\"])\n",
    "            n = df[\"numMoviePairs\"]\n",
    "            df[\"percentiles\"] = (n/n.sum())*100\n",
    "            print(df)\n",
    "    except Exception:\n",
    "        raise\n",
    "    finally:\n",
    "        d.close()\n",
    "\n",
    "find_genre_percentiles(driver)\n"
   ],
   "id": "21bae6ee9f028d0a",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   genreScore  numMoviePairs  percentiles\n",
      "1           1         458002    93.509681\n",
      "0           2          30230     6.172020\n",
      "2           3           1512     0.308703\n",
      "3           4             44     0.008983\n",
      "4           5              3     0.000613\n"
     ]
    }
   ],
   "execution_count": 219
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "So from the above we can see that 93.5% of movies share one genre, 6% share 2 and less than a percentage for the rest. So will define `genreScoreThreshold = 2`",
   "id": "b82250437142365"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-14T18:23:44.206971Z",
     "start_time": "2025-12-14T18:23:42.654221Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def f(tx, genre_score_threshold):\n",
    "    query = \"\"\"\n",
    "    WITH $genreScoreThreshold AS genreScoreThreshold\n",
    "    MATCH (m1:Movie)-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(m2:Movie)\n",
    "    WHERE m1.movieId < m2.movieId\n",
    "    WITH m1, m2, count(DISTINCT g) AS genreScore\n",
    "    WHERE genreScore >= 2\n",
    "    MERGE (m1)-[s:SIMILAR_TO]->(m2)\n",
    "    SET s.genreScore = genreScore;\n",
    "    \"\"\"\n",
    "    result = tx.run(query, genreScoreThreshold=genre_score_threshold)\n",
    "    return [record.data() for record in result]\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "try:\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        triangles: list[dict] = session.execute_write(f, genre_score_threshold=2)\n",
    "        if not triangles:\n",
    "            print(\"no matches found\")\n",
    "        for tri in triangles:\n",
    "            pprint.pp(tri)\n",
    "except Exception:\n",
    "    raise\n",
    "finally:\n",
    "    driver.close()\n"
   ],
   "id": "ba2d1b5e6608b3e3",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "no matches found\n"
     ]
    }
   ],
   "execution_count": 222
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
